AliRezaJoodi/CrossPlatformLibraries/platforms/stm32f1/peripherals/aj_usart.h
/**
 * @brief   Universal synchronous/asynchronous receiver transmitter (USART) interface for STM32 peripherals.
 *
 * This file provides helper APIs for managing USART control, status and data registers, including:
 * - USARTx->DR
 * - USARTx->SR
 * - USARTx->BRR
 * - USARTx->CR1
 * - USARTx->CR2
 * - USARTx->CR3
 * - USARTx->GTPR
 *
 * -----------------------------------------------------------------------------
 * REQUIREMENT 1: Compilation & Linkage
 * -----------------------------------------------------------------------------
 * The following source files must be compiled and linked in the project:
 * - `aj_usart.c`
 *
 * -----------------------------------------------------------------------------
 * REQUIREMENT 2: BUS Configuration
 * -----------------------------------------------------------------------------
 * This library does not enable any peripheral clock.
 * The application must enable the required clock buses before using this driver.
 * The following clock buses must be enabled:
 * - The clock bus of the USART peripheral (e.g., USART1 on APB2)
 * - The clock bus of the GPIO port used by the serial TX and RX pins
 *   (e.g., GPIOA on APB2)
 *
 * -----------------------------------------------------------------------------
 * REQUIREMENT 3: GPIO Configuration
 * -----------------------------------------------------------------------------
 * This library does not configure any GPIO pin.
 * The application must initialize the pins used for serial communication before using this driver.
 * The serial pins must meet these parameters:
 * - TX pin: alternate function output push-pull, high speed
 * - RX pin: floating input
 *
 * -----------------------------------------------------------------------------
 * REQUIREMENT 4: Default Configuration
 * -----------------------------------------------------------------------------
 * The default driver macros are declared in the following headers:
 * - `aj_target.h`
 *
 * -----------------------------------------------------------------------------
 * REQUIREMENT 5: User Configuration Override
 * -----------------------------------------------------------------------------
 * This library's default configuration can be customized via the central
 * project hardware configuration file, which MUST be present alongside your
 * project source files. Override the macros inside it:
 * - `hardware.h`
 *
 * @author  AliReza Joodi
 * @see     https://github.com/AliRezaJoodi
 */

#ifndef AJ_USART_INCLUDED
#define AJ_USART_INCLUDED

#ifdef __cplusplus
extern "C" {
#endif


#include <stdint.h>
#include <stm32f1xx.h>
#include "aj_bit_reg.h"
#include "aj_usart_type.h"

void AJ_USART_ConfigOperatingMode(USART_TypeDef *USARTx, aj_usart_mode_t mode);

/******************************************************************************/
/* Data register (USART_DR)                                                   */
/******************************************************************************/
static inline uint8_t AJ_USART_ReceiveData_8Bit(const USART_TypeDef *USARTx){
  return (uint8_t)(USARTx->DR & 0x00FFU);
}

static inline uint16_t AJ_USART_ReceiveData_9Bit(const USART_TypeDef *USARTx){
  return (uint16_t)(USARTx->DR & 0x01FFU);
}

static inline void AJ_USART_TransmitData_8Bit(USART_TypeDef *USARTx, uint8_t value){
  USARTx->DR = (uint32_t)value;
}

static inline void AJ_USART_TransmitData_9Bit(USART_TypeDef *USARTx, uint16_t value){
  USARTx->DR = (uint32_t)(value & 0x1FFU);
}

/******************************************************************************/
/* Baud rate register (USART_BRR)                                             */
/******************************************************************************/
#if defined(USART_CR1_OVER8_Msk)
void AJ_USART_ConfigBaudRate_8x(USART_TypeDef *USARTx, uint32_t periphclk, uint32_t baudrate);
#endif

void AJ_USART_ConfigBaudRate_16x(USART_TypeDef *USARTx, uint32_t periphclk, uint32_t baudrate);

/******************************************************************************/
/* Status register (USART_SR)                                                 */
/******************************************************************************/
static inline uint8_t AJ_USART_SR_IsFlagActive(const USART_TypeDef *USARTx, aj_usart_sr_state_t sr_flag){
  return AJ_BitReg_IsBitSet_Mask(&(USARTx->SR), sr_flag);
}

static inline void AJ_USART_SR_ClearFlagByWriteZero(USART_TypeDef *USARTx, aj_usart_sr_state_w0_t sr_flag){
  AJ_BitReg_ClearBit_Mask(&(USARTx->SR), sr_flag);
}

static inline void AJ_USART_SR_ClearFlagByRead(USART_TypeDef *USARTx, aj_usart_sr_state_r_t sr_flag){
  volatile uint32_t tmpreg;
  tmpreg = USARTx->SR;
  (void) tmpreg;
  tmpreg = USARTx->DR;
  (void) tmpreg;
}

//static inline uint8_t AJ_USART_IsFlagActive_CTS(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->SR), USART_SR_CTS_Msk);
//}
//
//static inline void AJ_USART_ClearFlag_CTS(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->SR), USART_SR_CTS_Msk);
//}
//
//static inline uint8_t AJ_USART_IsFlagActive_LinBreakDetection(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->SR), USART_SR_LBD_Msk);
//}
//
//static inline void AJ_USART_ClearFlag_LinBreakDetection(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->SR), USART_SR_LBD_Msk);
//}
//
//static inline uint8_t AJ_USART_IsFlagActive_TransmitDataEmpty(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->SR), USART_SR_TXE_Msk);
//}
//
//static inline uint8_t AJ_USART_IsFlagActive_TransmissionComplete(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->SR), USART_SR_TC_Msk);
//}
//
//static inline void AJ_USART_ClearFlag_TransmissionComplete(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->SR), USART_SR_TC_Msk);
//}
//
//static inline uint8_t AJ_USART_IsFlagActive_ReceiveDataNotEmpty(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->SR), USART_SR_RXNE_Msk);
//}
//
//static inline void AJ_USART_ClearFlag_ReceiveDataNotEmpty(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->SR), USART_SR_RXNE_Msk);
//}
//
//static inline uint8_t AJ_USART_IsFlagActive_IdleLine(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->SR), USART_SR_IDLE_Msk);
//}
//
//static inline void AJ_USART_ClearFlag_IdleLine(USART_TypeDef *USARTx){
//  volatile uint32_t tmpreg;
//  tmpreg = USARTx->SR;
//  (void) tmpreg;
//  tmpreg = USARTx->DR;
//  (void) tmpreg;
//}
//
//static inline uint8_t AJ_USART_IsFlagActive_OverrunError(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->SR), USART_SR_ORE_Msk);
//}
//
//static inline void AJ_USART_ClearFlag_OverrunError(USART_TypeDef *USARTx){
//  volatile uint32_t tmpreg;
//  tmpreg = USARTx->SR;
//  (void) tmpreg;
//  tmpreg = USARTx->DR;
//  (void) tmpreg;
//}
//
//static inline uint8_t AJ_USART_IsFlagActive_NoiseError(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->SR), USART_SR_NE_Msk);
//}
//
//static inline void AJ_USART_ClearFlag_NoiseError(USART_TypeDef *USARTx){
//  volatile uint32_t tmpreg;
//  tmpreg = USARTx->SR;
//  (void) tmpreg;
//  tmpreg = USARTx->DR;
//  (void) tmpreg;
//}
//
//static inline uint8_t AJ_USART_IsFlagActive_FramingError(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->SR), USART_SR_FE_Msk);
//}
//
//static inline void AJ_USART_ClearFlag_FramingError(USART_TypeDef *USARTx){
//  volatile uint32_t tmpreg;
//  tmpreg = USARTx->SR;
//  (void) tmpreg;
//  tmpreg = USARTx->DR;
//  (void) tmpreg;
//}
//
//static inline uint8_t AJ_USART_IsFlagActive_ParityError(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->SR), USART_SR_PE_Msk);
//}
//
//static inline void AJ_USART_ClearFlag_ParityError(USART_TypeDef *USARTx){
//  volatile uint32_t tmpreg;
//  tmpreg = USARTx->SR;
//  (void) tmpreg;
//  tmpreg = USARTx->DR;
//  (void) tmpreg;
//}


/******************************************************************************/
/* Control register 1 (USART_CR1)                                             */
/******************************************************************************/
static inline void AJ_USART_CR1_EnableBit(USART_TypeDef *USARTx, aj_usart_cr1_state_t mask){
  AJ_BitReg_SetBit_Mask(&(USARTx->CR1), mask);
}

static inline void AJ_USART_CR1_DisableBit(USART_TypeDef *USARTx, aj_usart_cr1_state_t mask){
  AJ_BitReg_ClearBit_Mask(&(USARTx->CR1), mask);
}

static inline uint8_t AJ_USART_CR1_IsBitEnabled(const USART_TypeDef *USARTx, aj_usart_cr1_state_t mask){
  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR1), mask);
}

#if defined(USART_CR1_OVER8_Msk)
static inline void AJ_USART_ConfigOverSampling(USART_TypeDef *USARTx, aj_usart_cr1_oversampling_t oversampling){
  AJ_BitReg_ModifyBit_Mask(&(USARTx->CR1), USART_CR1_OVER8_Msk, oversampling);
}

static inline aj_usart_cr1_oversampling_t AJ_USART_GetOverSampling(const USART_TypeDef *USARTx){
  return (aj_usart_cr1_oversampling_t)AJ_BitReg_GetBit_Mask(&(USARTx->CR1), USART_CR1_OVER8_Msk);
}
#endif

//static inline void AJ_USART_EnablePeripheral(USART_TypeDef *USARTx){
//  AJ_BitReg_SetBit_Mask(&(USARTx->CR1), USART_CR1_UE_Msk);
//}
//
//static inline void AJ_USART_DisablePeripheral(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->CR1), USART_CR1_UE_Msk);
//}
//
//static inline uint8_t AJ_USART_IsPeripheralEnabled(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR1), USART_CR1_UE_Msk);
//}

static inline void AJ_USART_ConfigWordLength(USART_TypeDef *USARTx, aj_usart_cr1_wordlength_t length){
  AJ_BitReg_ModifyBit_Mask(&(USARTx->CR1), USART_CR1_M_Msk, length);
}

static inline aj_usart_cr1_wordlength_t AJ_USART_GetWordLength(const USART_TypeDef *USARTx){
  return (aj_usart_cr1_wordlength_t)AJ_BitReg_GetBit_Mask(&(USARTx->CR1), USART_CR1_M_Msk);
}

static inline void AJ_USART_ConfigWakeupMethod(USART_TypeDef *USARTx, aj_usart_cr1_wakeup_t wakeup){
  AJ_BitReg_ModifyBit_Mask(&(USARTx->CR1), USART_CR1_WAKE_Msk, wakeup);
}

static inline aj_usart_cr1_wakeup_t AJ_USART_GetWakeupMethod(const USART_TypeDef *USARTx){
  return (aj_usart_cr1_wakeup_t)AJ_BitReg_GetBit_Mask(&(USARTx->CR1), USART_CR1_WAKE_Msk);
}

static inline void AJ_USART_ConfigParity(USART_TypeDef *USARTx, aj_usart_cr1_parity_t parity){
  AJ_BitReg_ModifyBit_Mask(&(USARTx->CR1), (USART_CR1_PCE_Msk | USART_CR1_PS_Msk), parity);
}

static inline aj_usart_cr1_parity_t AJ_USART_GetParity(const USART_TypeDef *USARTx){
  return (aj_usart_cr1_parity_t)AJ_BitReg_GetBit_Mask(&(USARTx->CR1), (USART_CR1_PCE_Msk | USART_CR1_PS_Msk));
}

//static inline void AJ_USART_EnableInterrupt_ParityError(USART_TypeDef *USARTx){
//  AJ_BitReg_SetBit_Mask(&(USARTx->CR1), USART_CR1_PEIE_Msk);
//}
//
//static inline void AJ_USART_DisableInterrupt_ParityError(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->CR1), USART_CR1_PEIE_Msk);
//}
//
//static inline uint8_t AJ_USART_IsInterruptEnabled_ParityError(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR1), USART_CR1_PEIE_Msk);
//}
//
//static inline void AJ_USART_EnableInterrupt_TxEmpty(USART_TypeDef *USARTx){
//  AJ_BitReg_SetBit_Mask(&(USARTx->CR1), USART_CR1_TXEIE_Msk);
//}
//
//static inline void AJ_USART_DisableInterrupt_TxEmpty(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->CR1), USART_CR1_TXEIE_Msk);
//}
//
//static inline uint8_t AJ_USART_IsInterruptEnabled_TxEmpty(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR1), USART_CR1_TXEIE_Msk);
//}
//
//static inline void AJ_USART_EnableInterrupt_TransmissionComplete(USART_TypeDef *USARTx){
//  AJ_BitReg_SetBit_Mask(&(USARTx->CR1), USART_CR1_TCIE_Msk);
//}
//
//static inline void AJ_USART_DisableInterrupt_TransmissionComplete(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->CR1), USART_CR1_TCIE_Msk);
//}
//
//static inline uint8_t AJ_USART_IsInterruptEnabled_TransmissionComplete(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR1), USART_CR1_TCIE_Msk);
//}
//
//static inline void AJ_USART_EnableInterrupt_RxNotEmpty(USART_TypeDef *USARTx){
//  AJ_BitReg_SetBit_Mask(&(USARTx->CR1), USART_CR1_RXNEIE_Msk);
//}
//
//static inline void AJ_USART_DisableInterrupt_RxNotEmpty(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->CR1), USART_CR1_RXNEIE_Msk);
//}
//
//static inline uint8_t AJ_USART_IsInterruptEnabled_RxNotEmpty(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR1), USART_CR1_RXNEIE_Msk);
//}
//
//static inline void AJ_USART_EnableInterrupt_IdleLine(USART_TypeDef *USARTx){
//  AJ_BitReg_SetBit_Mask(&(USARTx->CR1), USART_CR1_IDLEIE_Msk);
//}
//
//static inline void AJ_USART_DisableInterrupt_IdleLine(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->CR1), USART_CR1_IDLEIE_Msk);
//}
//
//static inline uint8_t AJ_USART_IsInterruptEnabled_IdleLine(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR1), USART_CR1_IDLEIE_Msk);
//}

//static inline void AJ_USART_ConfigDirection(USART_TypeDef *USARTx, aj_usart_cr1_direction_t direction){
//  AJ_BitReg_ModifyBit_Mask(&(USARTx->CR1), (USART_CR1_TE_Msk | USART_CR1_RE_Msk), direction);
//}
//
//static inline aj_usart_cr1_direction_t AJ_USART_GetDirection(const USART_TypeDef *USARTx){
//  return (aj_usart_cr1_direction_t)AJ_BitReg_GetBit_Mask(&(USARTx->CR1), (USART_CR1_TE_Msk | USART_CR1_RE_Msk));
//}

//static inline void AJ_USART_RequestEnterMuteMode(USART_TypeDef *USARTx){
//  AJ_BitReg_SetBit_Mask(&(USARTx->CR1), USART_CR1_RWU_Msk);
//}
//
//static inline void AJ_USART_RequestExitMuteMode(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->CR1), USART_CR1_RWU_Msk);
//}
//
//static inline uint8_t AJ_USART_IsMuteModeActive(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR1), USART_CR1_RWU_Msk);
//}

static inline void AJ_USART_RequestBreakSending(USART_TypeDef *USARTx){
  AJ_BitReg_SetBit_Mask(&(USARTx->CR1), USART_CR1_SBK_Msk);
}

/******************************************************************************/
/* Control register 2 (USART_CR2)                                             */
/******************************************************************************/
static inline void AJ_USART_CR2_EnableBit(USART_TypeDef *USARTx, aj_usart_cr2_state_t mask){
  AJ_BitReg_SetBit_Mask(&(USARTx->CR2), mask);
}

static inline void AJ_USART_CR2_DisableBit(USART_TypeDef *USARTx, aj_usart_cr2_state_t mask){
  AJ_BitReg_ClearBit_Mask(&(USARTx->CR2), mask);
}

static inline uint8_t AJ_USART_CR2_IsBitEnabled(const USART_TypeDef *USARTx, aj_usart_cr2_state_t mask){
  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR2), mask);
}

//static inline void AJ_USART_EnableLIN(USART_TypeDef *USARTx){
//  AJ_BitReg_SetBit_Mask(&(USARTx->CR2), USART_CR2_LINEN_Msk);
//}
//
//static inline void AJ_USART_DisableLIN(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->CR2), USART_CR2_LINEN_Msk);
//}
//
//static inline uint8_t AJ_USART_IsLINEnabled(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR2), USART_CR2_LINEN_Msk);
//}

static inline void AJ_USART_ConfigStopBitsLength(USART_TypeDef *USARTx, aj_usart_cr2_stopbits_t stopbits){
  AJ_BitReg_ModifyBit_Mask(&(USARTx->CR2), USART_CR2_STOP_Msk, stopbits);
}

static inline aj_usart_cr2_stopbits_t AJ_USART_GetStopBitsLength(const USART_TypeDef *USARTx){
  return (aj_usart_cr2_stopbits_t)AJ_BitReg_GetBit_Mask(&(USARTx->CR2), USART_CR2_STOP_Msk);
}

//static inline void AJ_USART_EnableClockPin(USART_TypeDef *USARTx){
//  AJ_BitReg_SetBit_Mask(&(USARTx->CR2), USART_CR2_CLKEN_Msk);
//}
//
//static inline void AJ_USART_DisableClockPin(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->CR2), USART_CR2_CLKEN_Msk);
//}
//
//static inline uint8_t AJ_USART_IsClockPinEnabled(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR2), USART_CR2_CLKEN_Msk);
//}

static inline void AJ_USART_ConfigClockPolarity(USART_TypeDef *USARTx, aj_usart_cr2_clock_polarity_t polarity){
  AJ_BitReg_ModifyBit_Mask(&(USARTx->CR2), USART_CR2_CPOL_Msk, polarity);
}

static inline aj_usart_cr2_clock_polarity_t AJ_USART_GetClockPolarity(const USART_TypeDef *USARTx){
  return (aj_usart_cr2_clock_polarity_t)AJ_BitReg_GetBit_Mask(&(USARTx->CR2), USART_CR2_CPOL_Msk);
}

static inline void AJ_USART_ConfigClockPhase(USART_TypeDef *USARTx, aj_usart_cr2_clock_phase_t phase){
  AJ_BitReg_ModifyBit_Mask(&(USARTx->CR2), USART_CR2_CPHA_Msk, phase);
}

static inline aj_usart_cr2_clock_phase_t AJ_USART_GetClockPhase(const USART_TypeDef *USARTx){
  return (aj_usart_cr2_clock_phase_t)AJ_BitReg_GetBit_Mask(&(USARTx->CR2), USART_CR2_CPHA_Msk);
}

//static inline void AJ_USART_EnableLastBitClockPulse(USART_TypeDef *USARTx){
//  AJ_BitReg_SetBit_Mask(&(USARTx->CR2), USART_CR2_LBCL_Msk);
//}
//
//static inline void AJ_USART_DisableLastBitClockPulse(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->CR2), USART_CR2_LBCL_Msk);
//}
//
//static inline void AJ_USART_EnableInterrupt_LINBreakDetection(USART_TypeDef *USARTx){
//  AJ_BitReg_SetBit_Mask(&(USARTx->CR2), USART_CR2_LBDIE_Msk);
//}
//
//static inline void AJ_USART_DisableInterrupt_LINBreakDetection(USART_TypeDef *USARTx){
//  AJ_BitReg_ClearBit_Mask(&(USARTx->CR2), USART_CR2_LBDIE_Msk);
//}
//
//static inline uint8_t AJ_USART_IsInterruptEnabled_LINBreakDetection(const USART_TypeDef *USARTx){
//  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR2), USART_CR2_LBDIE_Msk);
//}

static inline void AJ_USART_ConfigLINBreakDetectLength(USART_TypeDef *USARTx, aj_usart_cr2_lin_break_detection_t length){
  AJ_BitReg_ModifyBit_Mask(&(USARTx->CR2), USART_CR2_LBDL_Msk, length);
}

static inline aj_usart_cr2_lin_break_detection_t AJ_USART_GetLINBreakDetectLength(const USART_TypeDef *USARTx){
  return (aj_usart_cr2_lin_break_detection_t)AJ_BitReg_GetBit_Mask(&(USARTx->CR2), USART_CR2_LBDL_Msk);
}

static inline void AJ_USART_ConfigNodeAddress(USART_TypeDef *USARTx, uint32_t address){
  AJ_BitReg_ModifyBit_Mask(&(USARTx->CR2), USART_CR2_ADD_Msk, (address & USART_CR2_ADD_Msk));
}

static inline uint32_t AJ_USART_GetNodeAddress(const USART_TypeDef *USARTx){
  return (uint32_t)AJ_BitReg_GetBit_Mask(&(USARTx->CR2), USART_CR2_ADD_Msk);
}

/******************************************************************************/
/* Control register 3 (USART_CR3)                                             */
/******************************************************************************/
static inline void AJ_USART_CR3_EnableBit(USART_TypeDef *USARTx, aj_usart_cr3_state_t mask){
  AJ_BitReg_SetBit_Mask(&(USARTx->CR3), mask);
}

static inline void AJ_USART_CR3_DisableBit(USART_TypeDef *USARTx, aj_usart_cr3_state_t mask){
  AJ_BitReg_ClearBit_Mask(&(USARTx->CR3), mask);
}

static inline uint8_t AJ_USART_CR3_IsBitEnabled(const USART_TypeDef *USARTx, aj_usart_cr3_state_t mask){
  return AJ_BitReg_IsBitSet_Mask(&(USARTx->CR3), mask);
}

/******************************************************************************/
/* Guard time and prescaler register (USART_GTPR)                             */
/******************************************************************************/
static inline void AJ_USART_ConfigSmartcardGuardTime(USART_TypeDef *USARTx, uint32_t guard_time){
  AJ_BitReg_ModifyBit_Mask(&(USARTx->GTPR), USART_GTPR_GT_Msk, (guard_time << USART_GTPR_GT_Pos));
}

static inline uint32_t AJ_USART_GetSmartcardGuardTime(const USART_TypeDef *USARTx){
  return (uint32_t)(AJ_BitReg_GetBit_Mask(&(USARTx->GTPR), USART_GTPR_GT_Msk) >> USART_GTPR_GT_Pos);
}

static inline void AJ_USART_ConfigSmartcardPrescaler(USART_TypeDef *USARTx, uint32_t prescaler){
  AJ_BitReg_ModifyBit_Mask(&(USARTx->GTPR), USART_GTPR_PSC_Msk, prescaler);
}

static inline uint32_t AJ_USART_GetSmartcardPrescaler(const USART_TypeDef *USARTx){
  return (uint32_t)AJ_BitReg_GetBit_Mask(&(USARTx->GTPR), USART_GTPR_PSC_Msk);
}


#ifdef __cplusplus
}
#endif

#endif	/* AJ_USART_INCLUDED */